#+TITLE:     Datamining tp2
#+AUTHOR:    David Tabarie
#+LANGUAGE:  fr
#+LaTeX_CLASS: article
#+STARTUP: showall

#+PROPERTY: R :cmd "/usr/bin/R"

* Sujet
Le TP consiste à préparer les données d'un fichier afin de pouvoir effectuer des régressions ou fouilles dessus.
A partir du fichier de Consommation électrique annuelle à la maille
département disponible à l'adresse
https://www.data.gouv.fr/fr/datasets/r/7f293530-354f-4721-aa4e-ae578a377180
et décrit sur
https://www.data.gouv.fr/fr/datasets/consommation-electrique-annuelle-a-la-maille-departement/ :

* Charger le fichier csv avec la commande read.csv
#+BEGIN_SRC R
data <- read.csv(file="consommation-electrique-par-secteur-dactivite-departement.csv", header=TRUE, sep=";", encoding="UTF-8")
#+END_SRC

* Vérifier le bon chargement avec un sommaire (summary)
#+BEGIN_SRC R :exports all
data <- read.csv(file="consommation-electrique-par-secteur-dactivite-departement.csv", header=TRUE, sep=";", encoding="UTF-8")
names(data) # Summary ne s'affiche pas bien dans mon éditeur, je met donc le commande name.
#+END_SRC

#+RESULTS:
| Année                                  |
| Nom.département                        |
| Code.département                       |
| Nom.région                             |
| Code.région                            |
| Nb.sites.Résidentiel                   |
| Conso.totale.Résidentiel..MWh.         |
| Conso.moyenne.Résidentiel..MWh.        |
| Nb.sites.Professionnel                 |
| Conso.totale.Professionnel..MWh.       |
| Conso.moyenne.Professionnel..MWh.      |
| Nb.sites.Agriculture                   |
| Conso.totale.Agriculture..MWh.         |
| Nb.sites.Industrie                     |
| Conso.totale.Industrie..MWh.           |
| Nb.sites.Tertiaire                     |
| Conso.totale.Tertiaire..MWh.           |
| Nb.sites.Secteur.non.affecté           |
| Conso.totale.Secteur.non.affecté..MWh. |
| Nombre.d.habitants                     |
| Taux.de.logements.collectifs           |
| Taux.de.résidences.principales         |
| Superficie.des.logements...30.m2       |
| Superficie.des.logements.30.à.40.m2    |
| Superficie.des.logements.40.à.60.m2    |
| Superficie.des.logements.60.à.80.m2    |
| Superficie.des.logements.80.à.100.m2   |
| Superficie.des.logements...100.m2      |
| Résidences.principales.avant.1919      |
| Résidences.principales.de.1919.à.1945  |
| Résidences.principales.de.1946.à.1970  |
| Résidences.principales.de.1971.à.1990  |
| Résidences.principales.de.1991.à.2005  |
| Résidences.principales.de.2006.à.2010  |
| Résidences.principales.après.2011      |
| Taux.de.chauffage.électrique           |
| Geo.Shape                              |
| Geo.Point.2D                           |

* Supprimer les colonnes de type texte et la colonne geoshape
#+BEGIN_SRC R :exports all
data <- read.csv(file="consommation-electrique-par-secteur-dactivite-departement.csv", header=TRUE, sep=";")
data$Geo.Shape <- Nom.département <- Nom.région <- NULL
summary(data)
#+END_SRC

#+RESULTS:
| Min.   :2011 | Ain                    :  7 | Min.   : 1.0 | Occitanie              : 91 | Min.   :11.0 | Min.   :  50322 | Min.   : 181058 | Min.   :3.044 | Min.   :  7818 | Min.   :  68490 | Min.   : 6.443 | Min.   :   2.0 | Min.   :    44.99 | Min.   : 125.0 | Min.   :  40102 | Min.   :  484 | Min.   :  80055 | Min.   :  0.00 | Min.   :     0.0 | Min.   :  76607 | Min.   :13.43 | Min.   :51.86 | Min.   : 1.215 | Min.   : 2.551 | Min.   : 6.999 | Min.   :14.17 | Min.   : 9.795 | Min.   : 9.682 | Min.   : 5.168 | Min.   : 4.458 | Min.   :13.45 | Min.   :18.46 | Min.   : 6.386 | Min.   : 1.134 | Min.   :0.421 | Min.   :11.81 | :564                               |
| 1st Qu.:2012 | Aisne                  :  7 | 1st Qu.:25.0 | Auvergne-Rhône-Alpes   : 84 | 1st Qu.:28.0 | 1st Qu.: 140810 | 1st Qu.: 747554 | 1st Qu.:4.449 | 1st Qu.: 23474 | 1st Qu.: 207113 | 1st Qu.: 8.744 | 1st Qu.:  63.0 | 1st Qu.:  6505.05 | 1st Qu.: 513.8 | 1st Qu.: 331736 | 1st Qu.: 1577 | 1st Qu.: 334852 | 1st Qu.: 12.00 | 1st Qu.:   395.6 | 1st Qu.: 307500 | 1st Qu.:22.24 | 1st Qu.:82.83 | 1st Qu.: 1.820 | 1st Qu.: 3.490 | 1st Qu.:10.526 | 1st Qu.:19.05 | 1st Qu.:23.474 | 1st Qu.:30.284 | 1st Qu.:12.898 | 1st Qu.: 6.652 | 1st Qu.:17.17 | 1st Qu.:26.30 | 1st Qu.:12.480 | 1st Qu.: 5.383 | 1st Qu.:1.970 | 1st Qu.:22.05 | 42.5997648583, 2.52242772057  :  1 |
| Median :2014 | Allier                 :  7 | Median :48.5 | Nouvelle Aquitaine     : 84 | Median :52.5 | Median : 269026 | Median :1316481 | Median :4.888 | Median : 39460 | Median : 376005 | Median : 9.384 | Median : 176.0 | Median : 16942.16 | Median : 786.5 | Median : 523833 | Median : 2798 | Median : 685994 | Median : 32.00 | Median :  1173.8 | Median : 545007 | Median :32.03 | Median :91.63 | Median : 2.717 | Median : 4.247 | Median :12.196 | Median :21.23 | Median :25.811 | Median :33.303 | Median :17.204 | Median : 7.968 | Median :20.26 | Median :28.21 | Median :14.851 | Median : 6.552 | Median :2.323 | Median :25.70 | 42.9209617833, 1.50364203972  :  1 |
| Mean   :2014 | Alpes-de-Haute-Provence:  7 | Mean   :48.3 | Grand-Est              : 70 | Mean   :54.4 | Mean   : 329423 | Mean   :1574334 | Mean   :4.881 | Mean   : 46891 | Mean   : 450122 | Mean   : 9.429 | Mean   : 290.7 | Mean   : 33357.08 | Mean   : 901.8 | Mean   : 634430 | Mean   : 3728 | Mean   : 977688 | Mean   : 47.79 | Mean   :  5525.2 | Mean   : 674230 | Mean   :35.68 | Mean   :88.21 | Mean   : 3.341 | Mean   : 4.769 | Mean   :12.685 | Mean   :21.03 | Mean   :24.861 | Mean   :33.315 | Mean   :17.979 | Mean   : 9.017 | Mean   :20.76 | Mean   :28.23 | Mean   :14.916 | Mean   : 6.659 | Mean   :2.432 | Mean   :26.97 | 43.0537262879, 0.163931506329 :  1 |
| 3rd Qu.:2016 | Alpes-Maritimes        :  7 | 3rd Qu.:72.0 | Bourgogne-Franche-Comté: 56 | 3rd Qu.:76.0 | 3rd Qu.: 410274 | 3rd Qu.:2139173 | 3rd Qu.:5.311 | 3rd Qu.: 56406 | 3rd Qu.: 573594 | 3rd Qu.:10.004 | 3rd Qu.: 373.8 | 3rd Qu.: 38240.83 | 3rd Qu.:1163.0 | 3rd Qu.: 824960 | 3rd Qu.: 4514 | 3rd Qu.:1092015 | 3rd Qu.: 55.00 | 3rd Qu.:  3242.6 | 3rd Qu.: 903921 | 3rd Qu.:45.61 | 3rd Qu.:95.22 | 3rd Qu.: 4.143 | 3rd Qu.: 5.336 | 3rd Qu.:13.861 | 3rd Qu.:22.88 | 3rd Qu.:27.254 | 3rd Qu.:38.644 | 3rd Qu.:22.439 | 3rd Qu.: 9.682 | 3rd Qu.:23.14 | 3rd Qu.:30.11 | 3rd Qu.:17.359 | 3rd Qu.: 7.573 | 3rd Qu.:2.858 | 3rd Qu.:31.70 | 43.1033032163, 2.41364299911  :  1 |
| Max.   :2017 | Ardèche                :  7 | Max.   :95.0 | Île-de-France          : 56 | Max.   :93.0 | Max.   :1367617 | Max.   :5342493 | Max.   :6.656 | Max.   :244735 | Max.   :2298164 | Max.   :12.770 | Max.   :1265.0 | Max.   :277158.36 | Max.   :3088.0 | Max.   :2831241 | Max.   :25295 | Max.   :6809824 | Max.   :568.00 | Max.   :303986.0 | Max.   :2595535 | Max.   :99.02 | Max.   :99.12 | Max.   :21.534 | Max.   :17.278 | Max.   :25.738 | Max.   :28.18 | Max.   :30.067 | Max.   :50.296 | Max.   :38.318 | Max.   :21.497 | Max.   :34.89 | Max.   :36.43 | Max.   :24.590 | Max.   :11.453 | Max.   :3.933 | Max.   :49.08 | 43.2563150928, -0.761692494438:  1 |
| nil          | (Other)                :616 | nil          | (Other)                :217 | nil          | nil             | nil             | nil           | nil            | nil             | nil            | nil            | nil               | nil            | nil             | nil           | nil             | nil            | nil              | nil             | nil           | nil           | nil            | nil            | nil            | nil           | nil            | nil            | nil            | nil            | nil           | nil           | nil            | nil            | nil           | nil           | (Other)                       : 89 |

* Pour chaque intervalle de superficie, ajouter une colonne de consommation en MWh (utiliser la conso globale résidentielle)
#+BEGIN_SRC R :exports all
data <- read.csv(file="consommation-electrique-par-secteur-dactivite-departement.csv", header=TRUE, sep=";")
data <- data$Geo.Shape <- Nom.département <- Nom.région <- NULL
data <- cbind(data, "Consommation <30m2(MWh)" = (data$Conso.totale.RÃ.sidentiel..MWh./100) * data$Superficie.des.logements...30.m2, "Consommation 30 à 40m2(MWh)" = (data$Conso.totale.RÃ.sidentiel..MWh./100) * data$Superficie.des.logements.30.Ã..40.m2, "Consommation 40 à60m2(MWh)" = (data$Conso.totale.RÃ.sidentiel..MWh./100) * data$Superficie.des.logements.40.Ã..60.m2, "Consommation 60 à 80m2(MWh)" = (data$Conso.totale.RÃ.sidentiel..MWh./100) * data$Superficie.des.logements.60.Ã..80.m2, "Consommation 80 à100m2(MWh)" = (data$Conso.totale.RÃ.sidentiel..MWh./100) * data$Superficie.des.logements.80.Ã..100.m2,"Consommation > 100m2(MWh)" = (data$Conso.totale.RÃ.sidentiel..MWh./100) * data$Superficie.des.logements...100.m2)
summary(data)
#+END_SRC

#+RESULTS:
| Min.   : NA | Min.   : NA | Min.   : NA | Min.   : NA | Min.   : NA | Min.   : NA | Min.   : NA |
| 1st Qu.: NA | 1st Qu.: NA | 1st Qu.: NA | 1st Qu.: NA | 1st Qu.: NA | 1st Qu.: NA | 1st Qu.: NA |
| Median : NA | Median : NA | Median : NA | Median : NA | Median : NA | Median : NA | Median : NA |
| Mean   :NaN | Mean   :NaN | Mean   :NaN | Mean   :NaN | Mean   :NaN | Mean   :NaN | Mean   :NaN |
| 3rd Qu.: NA | 3rd Qu.: NA | 3rd Qu.: NA | 3rd Qu.: NA | 3rd Qu.: NA | 3rd Qu.: NA | 3rd Qu.: NA |
| Max.   : NA | Max.   : NA | Max.   : NA | Max.   : NA | Max.   : NA | Max.   : NA | Max.   : NA |

* Pour chaque catégorie (Résidentiel, Professionnel, Agriculture, Industrie, Tertiaire), ajouter une colonne de pourcentage pour calculer le % de consommation de la catégorie
#+BEGIN_SRC R :exports all
data <- read.csv(file="consommation-electrique-par-secteur-dactivite-departement.csv", header=TRUE, sep=";")
data <- data$Geo.Shape <- Nom.département <- Nom.région <- NULL
data <- cbind(data,"pourcentage Consommation Résidentiel" = ( 100 * data$Conso.totale.Ré.sidentiel..MWh.) / sum(data$Conso.totale.Ré.sidentiel..MWh,data$Conso.totale.Professionnel..MWh.,data$Conso.totale.Agriculture..MWh.,data$Conso.totale.Industrie..MWh.,data$Conso.totale.Tertiaire..MWh.,data$Conso.totale.Secteur.non.affecté...MWh.), "pourcentage Consommation Professionel" = ( 100 * data$Conso.totale.Professionnel..MWh.) / sum(data$Conso.totale.Ré.sidentiel..MWh,data$Conso.totale.Professionnel..MWh.,data$Conso.totale.Agriculture..MWh.,data$Conso.totale.Industrie..MWh.,data$Conso.totale.Tertiaire..MWh.,data$Conso.totale.Secteur.non.affecté...MWh.),"pourcentage Consommation Agriculture" = ( 100 *data$Conso.totale.Agriculture..MWh.) / sum(data$Conso.totale.Ré.sidentiel..MWh,data$Conso.totale.Professionnel..MWh.,data$Conso.totale.Agriculture..MWh.,data$Conso.totale.Industrie..MWh.,data$Conso.totale.Tertiaire..MWh.,data$Conso.totale.Secteur.non.affecté...MWh.),"pourcentage Consommation Industrie" = ( 100 * data$Conso.totale.Industrie..MWh.) / sum(data$Conso.totale.Ré.sidentiel..MWh,data$Conso.totale.Professionnel..MWh.,data$Conso.totale.Agriculture..MWh.,data$Conso.totale.Industrie..MWh.,data$Conso.totale.Tertiaire..MWh.,data$Conso.totale.Secteur.non.affecté...MWh.),"pourcentage Consommation tertiaire" = ( 100 *data$Conso.totale.Tertiaire..MWh.) / sum(data$Conso.totale.Ré.sidentiel..MWh,data$Conso.totale.Professionnel..MWh.,data$Conso.totale.Agriculture..MWh.,data$Conso.totale.Industrie..MWh.,data$Conso.totale.Tertiaire..MWh.,data$Conso.totale.Secteur.non.affecté...MWh.))
summary(data)
#+END_SRC

#+RESULTS:
| Min.   : NA | Min.   : NA | Min.   : NA | Min.   : NA | Min.   : NA | Min.   : NA |
| 1st Qu.: NA | 1st Qu.: NA | 1st Qu.: NA | 1st Qu.: NA | 1st Qu.: NA | 1st Qu.: NA |
| Median : NA | Median : NA | Median : NA | Median : NA | Median : NA | Median : NA |
| Mean   :NaN | Mean   :NaN | Mean   :NaN | Mean   :NaN | Mean   :NaN | Mean   :NaN |
| 3rd Qu.: NA | 3rd Qu.: NA | 3rd Qu.: NA | 3rd Qu.: NA | 3rd Qu.: NA | 3rd Qu.: NA |
| Max.   : NA | Max.   : NA | Max.   : NA | Max.   : NA | Max.   : NA | Max.   : NA |
